GOST_PARAMS = {
    'Шрифт': 'Times New Roman',
    'Размер шрифта': 14,
    'Верхнее поле (см)': 2.0,
    'Нижнее поле (см)': 2.0,
    'Левое поле (см)': 3.0,
    'Правое поле (см)': 1.0,
    'Межстрочный интервал': 1.5,
    'Отступ абзаца (см)': 1.25,
    'Наличие колонтитулов': True,
    'Наличие нумерации страниц': True,
    'Наличие титульного листа': True
}

REQUIRED_COLUMNS = [
    'Название документа', 'Автор', 'Дата создания', 'Шрифт',
    'Размер шрифта', 'Верхнее поле (см)', 'Нижнее поле (см)',
    'Левое поле (см)', 'Правое поле (см)', 'Межстрочный интервал',
    'Отступ абзаца (см)', 'Наличие колонтитулов',
    'Наличие нумерации страниц', 'Наличие титульного листа',
    'Соответствует ГОСТ'
]